domains/UFO/sim/decks/cfd_disc/case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object transportProperties; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel  Newtonian;

// sea-level air kinematic viscosity:
//   nu = mu/rho = 1.81e-5 / 1.225 = 1.48e-5 m2/s
//   Re_D = U*D/nu = 50*6/1.48e-5 = 2.03e7   (cruise-low band 1e6..1e8)
nu              1.48e-05;
// ************************************************************************* //
