domains/UFO/sim/decks/cfd_disc/case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }
    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent      yes;
    residualControl
    {
        p           1e-5;
        U           1e-5;
        "(k|omega)" 1e-5;
    }
}

relaxationFactors
{
    equations
    {
        U           0.9;
        ".*"        0.9;
    }
}
// ************************************************************************* //
